<template lang="pug">
    include ../../../../tools/mixins.pug

    +b.privacy
        +e.container.container
            +e.content.text--article-page
                h1 Политика конфиденциальности
                p Политика обработки персональных данных (далее – Политика сайта, Политика или Политика конфиденциальности) разработана в соответствии с Федеральным законом от 27.07.2006. №152-ФЗ «О персональных данных» (далее – ФЗ-152).
                p Настоящая Политика определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных у владельца сайта ИП Костыря Игорь Михайлович (далее сайт \"siteupers.ru\" или Оператор).
                p Целью настоящей политики конфиденциальности является обеспечение защиты прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.Если Вы не согласны с условиями нашей Политики конфиденциальности, не используйте сайт siteupers.ru!
                h2 Настоящая политика содержит следующую информацию:
                ol.numeric-list
                    li цель обработки персональных данных;
                    li перечень персональных данных, на обработку которых дается согласие субъекта персональных данных;
                    li наименование или фамилия, имя, отчество и адрес лица, осуществляющего обработку персональных данных по поручению оператора, если обработка будет поручена такому лицу;
                    li перечень действий с персональными данными, на совершение которых дается согласие, общее описание используемых оператором способов обработки персональных данных;
                    li срок, в течение которого действует согласие субъекта персональных данных, а также способ его отзыва, если иное не установлено федеральным законом;
                    li информацию о том, как можно отозвать свое согласие на обработку персональных данных.
                h2 Основные понятия, используемые в настоящей политике конфиденциальности:
                p Персональные данные - любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных);
                p Оператор - государственный орган, муниципальный орган, юридическое или физическое лицо, самостоятельно или совместно с другими лицами организующие и (или) осуществляющие обработку персональных данных, а также определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными;
                p Обработка персональных данных - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных;
                h2 Принципы сбора персональных данных:
                ol.numeric-list
                    li Обработка персональных данных осуществляется на законной и справедливой основе.
                    li Обработка персональных данных ограничивается достижением конкретных, заранее определенных и законных целей.
                    li Не допускается объединение баз данных, содержащих персональные данные, обработка которых осуществляется в целях, несовместимых между собой.
                    li Обработке подлежат только персональные данные, которые отвечают целям их обработки.
                    li Содержание и объем обрабатываемых персональных данных соответствуют заявленным целям обработки.
                    li При обработке персональных данных обеспечиваются точность персональных данных, их достаточность, а в необходимых случаях и актуальность по отношению к целям обработки персональных данных.
                    li Оператор принимает необходимые меры либо обеспечивает их принятие по удалению или уточнению неполных или неточных данных.
                    li Хранение персональных данных осуществляется в форме, позволяющей определить субъекта персональных данных, не дольше, чем этого требуют цели обработки персональных данных, если срок хранения персональных данных не установлен федеральным законом, договором, стороной которого, выгодоприобретателем или поручителем по которому является субъект персональных данных. Обрабатываемые персональные данные подлежат уничтожению либо обезличиванию по достижении целей обработки или в случае утраты необходимости в достижении этих целей, если иное не предусмотрено федеральным законом.
                h2 Перечень собираемых персональных данных
                p Оператор сайта может собирать следующую информацию о пользователях сайта:
                ul
                    li Фамилия, Имя, Отчество
                    li cookies
                    li Почтовый адрес и т.п.
                    li Адрес электронной почты
                    li Номер телефона
                    li IP-адрес
                    li Прочая информация
                h2 Управление персональными данными
                p Отзыв согласия на обработку Персональных данных пользователя, а так же удаление Персональных данных пользователя возможно по его письменному запросу, присланному на e-mail Оператора info@siteupers.ru, однако в случае отзыва согласия или удаления персональных данных, Оператор не может гарантировать качественного и всестороннего предоставления информации и/или услуг.
                h2 Использование информации
                p Ниже описаны некоторые способы использования личной информации пользователя:
                ol.numeric-list
                    li для внутреннего отчета
                    li для предоставления информации и услуг, которые запрашивает пользователь
                    li для формирования статистических данных
                h2 Раскрытие информации
                p Оператор не продает личные данные пользователя и не передает их третьим лицам без согласия на то пользователя.
                p Далее, описаны некоторые случаи передачи личной информации пользователя:
                ol
                    li в случаях, если это требуется органам спецслужб или если это требует законодательство
                h2 Прочая информация
                ol.numeric-list
                    li Срок действия настоящей Политики конфиденциальности не ограничен
                    li Настоящая Политика конфиденциальности теряет свою силу при появлении новой версии, размещенной на сайте siteupers.ru
                    li Дети любых возрастов могут беспрепятственно пользоваться данным сайтом.
</template>

<script>
    export default {
        data() {
            return {}
//            let language = this.$router.currentRoute.meta.language,
//                obj = {};
//
//            if (language === 'en') {
//                obj.content = this.$attrs.content.content.en;
//            } else {
//                obj.content = this.$attrs.content.content.ru;
//            }
//            return obj;
        },
        title() {
//            return this.content.meta.title;
        },
        meta() {
//            return this.content.meta.meta;
        },
    }
</script>